const λ = require("./malc");

const FIFTEEN = λ.PLUS(λ.TEN)(λ.FIVE);

const TWENTY = λ.PLUS(λ.TEN)(λ.TEN);

const HUNDRED = λ.MULT(λ.TEN)(λ.TEN);

const F = λ.MULT(λ.TEN)(λ.SEVEN);

const I = λ.PLUS(HUNDRED)(λ.FIVE);

const Z = λ.PLUS(HUNDRED)(λ.PLUS(TWENTY)(λ.TWO));

const B = λ.PLUS(λ.MULT(λ.TEN)(λ.SIX))(λ.SIX);

const U = λ.PLUS(HUNDRED)(λ.PLUS(λ.TEN)(λ.SEVEN));

const FIZZ = λ.LIST_ELEMENT(F)(
  λ.LIST_ELEMENT(I)(λ.LIST_ELEMENT(Z)(λ.LIST_ELEMENT(Z)(λ.EMPTY_LIST)))
);

const BUZZ = λ.LIST_ELEMENT(B)(
  λ.LIST_ELEMENT(U)(λ.LIST_ELEMENT(Z)(λ.LIST_ELEMENT(Z)(λ.EMPTY_LIST)))
);

const FIZZBUZZ = λ.APPEND(FIZZ)(BUZZ);

const FIZZBUZZFUNC = λ.MAP((n) =>
  λ.IF_THEN_ELSE(λ.IS_ZERO(λ.MOD(n)(FIFTEEN)))(FIZZBUZZ)(
    λ.IF_THEN_ELSE(λ.IS_ZERO(λ.MOD(n)(λ.THREE)))(FIZZ)(
      λ.IF_THEN_ELSE(λ.IS_ZERO(λ.MOD(n)(λ.FIVE)))(BUZZ)(n)
    )
  )
);

const FIZZBUZZFUNC_EXP = ((f) =>
  ((f) =>
    ((x) => f((y) => x(x)(y)))((x) =>
      f((y) => x(x)(y))
    ))((r) => (f) => (z) => (xs) =>
    ((p) => (x) => (y) => p(x)(y))(((p) => p((x) => (y) => x))(xs))(z)((x) =>
      f(
        ((xs) => ((p) => p((x) => (y) => x))(((p) => p((x) => (y) => y))(xs)))(
          xs
        )
      )(
        r(f)(z)(
          ((xs) =>
            ((p) => p((x) => (y) => y))(((p) => p((x) => (y) => y))(xs)))(xs)
        )
      )(x)
    )
  )((x) => (xs) =>
    ((x) => (xs) =>
      ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
        ((x) => (y) => (p) => p(x)(y))(x)(xs)
      ))(f(x))(xs)
  )(((x) => (y) => (p) => p(x)(y))((x) => (y) => x)((x) => (y) => x)))((n) =>
  ((p) => (x) => (y) => p(x)(y))(
    ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
      ((f) =>
        ((x) => f((y) => x(x)(y)))((x) =>
          f((y) => x(x)(y))
        ))((r) => (n) => (m) =>
        ((p) => (x) => (y) => p(x)(y))(
          ((n) => (m) =>
            ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
              ((n) => (m) =>
                m((n) =>
                  n((p) => (z) =>
                    z(((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x)))(
                      p((x) => (y) => x)
                    )
                  )((z) => z((f) => (x) => x)((f) => (x) => x))((x) => (y) => y)
                )(n))(n)(m)
            ))(m)(n)
        )((x) =>
          r(
            ((n) => (m) =>
              m((n) =>
                n((p) => (z) =>
                  z(((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x)))(
                    p((x) => (y) => x)
                  )
                )((z) => z((f) => (x) => x)((f) => (x) => x))((x) => (y) => y)
              )(n))(n)(m)
          )(m)(x)
        )(n)
      )(n)(
        ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
          f(f(f(f(f(f(f(f(f(f(x))))))))))
        )((f) => (x) => f(f(f(f(f(x))))))
      )
    )
  )(
    ((x) => (xs) =>
      ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
        ((x) => (y) => (p) => p(x)(y))(x)(xs)
      ))(
      ((n) => (m) =>
        m(
          ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
        )((f) => (x) => x))((f) => (x) =>
        f(f(f(f(f(f(f(f(f(f(x))))))))))
      )((f) => (x) => f(f(f(f(f(f(f(x))))))))
    )(
      ((x) => (xs) =>
        ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
          ((x) => (y) => (p) => p(x)(y))(x)(xs)
        ))(
        ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
          ((n) => (m) =>
            m(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
            )((f) => (x) => x))((f) => (x) =>
            f(f(f(f(f(f(f(f(f(f(x))))))))))
          )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
        )((f) => (x) => f(f(f(f(f(x))))))
      )(
        ((x) => (xs) =>
          ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
            ((x) => (y) => (p) => p(x)(y))(x)(xs)
          ))(
          ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
            ((n) => (m) =>
              m(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
              )((f) => (x) => x))((f) => (x) =>
              f(f(f(f(f(f(f(f(f(f(x))))))))))
            )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
          )(
            ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
              ((n) => (m) =>
                m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                f(f(f(f(f(f(f(f(f(f(x))))))))))
              )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
            )((f) => (x) => f(f(x)))
          )
        )(
          ((x) => (xs) =>
            ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
              ((x) => (y) => (p) => p(x)(y))(x)(xs)
            ))(
            ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
              ((n) => (m) =>
                m(
                  ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                )((f) => (x) => x))((f) => (x) =>
                f(f(f(f(f(f(f(f(f(f(x))))))))))
              )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
            )(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                ((n) => (m) =>
                  m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                  f(f(f(f(f(f(f(f(f(f(x))))))))))
                )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
              )((f) => (x) => f(f(x)))
            )
          )(
            ((x) => (xs) =>
              ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                ((x) => (y) => (p) => p(x)(y))(x)(xs)
              ))(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                ((n) => (m) =>
                  m(
                    ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                  )((f) => (x) => x))((f) => (x) =>
                  f(f(f(f(f(f(f(f(f(f(x))))))))))
                )((f) => (x) => f(f(f(f(f(f(x)))))))
              )((f) => (x) => f(f(f(f(f(f(x)))))))
            )(
              ((x) => (xs) =>
                ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                  ((x) => (y) => (p) => p(x)(y))(x)(xs)
                ))(U)(
                ((x) => (xs) =>
                  ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                    ((x) => (y) => (p) => p(x)(y))(x)(xs)
                  ))(
                  ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                    ((n) => (m) =>
                      m(
                        ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                      )((f) => (x) => x))((f) => (x) =>
                      f(f(f(f(f(f(f(f(f(f(x))))))))))
                    )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                  )(
                    ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                      ((n) => (m) =>
                        m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                        f(f(f(f(f(f(f(f(f(f(x))))))))))
                      )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                    )((f) => (x) => f(f(x)))
                  )
                )(
                  ((x) => (xs) =>
                    ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                      ((x) => (y) => (p) => p(x)(y))(x)(xs)
                    ))(
                    ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                      ((n) => (m) =>
                        m(
                          ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                            n
                          )
                        )((f) => (x) => x))((f) => (x) =>
                        f(f(f(f(f(f(f(f(f(f(x))))))))))
                      )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                    )(
                      ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                        ((n) => (m) =>
                          m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                          f(f(f(f(f(f(f(f(f(f(x))))))))))
                        )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                      )((f) => (x) => f(f(x)))
                    )
                  )(
                    ((x) => (y) => (p) => p(x)(y))((x) => (y) =>
                      x
                    )((x) => (y) => x)
                  )
                )
              )
            )
          )
        )
      )
    )
  )(
    ((p) => (x) => (y) => p(x)(y))(
      ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
        ((f) =>
          ((x) => f((y) => x(x)(y)))((x) =>
            f((y) => x(x)(y))
          ))((r) => (n) => (m) =>
          ((p) => (x) => (y) => p(x)(y))(
            ((n) => (m) =>
              ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
                ((n) => (m) =>
                  m((n) =>
                    n((p) => (z) =>
                      z(((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x)))(
                        p((x) => (y) => x)
                      )
                    )((z) => z((f) => (x) => x)((f) => (x) => x))((x) => (y) =>
                      y
                    )
                  )(n))(n)(m)
              ))(m)(n)
          )((x) =>
            r(
              ((n) => (m) =>
                m((n) =>
                  n((p) => (z) =>
                    z(((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x)))(
                      p((x) => (y) => x)
                    )
                  )((z) => z((f) => (x) => x)((f) => (x) => x))((x) => (y) => y)
                )(n))(n)(m)
            )(m)(x)
          )(n)
        )(n)((f) => (x) => f(f(f(x))))
      )
    )(
      ((x) => (xs) =>
        ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
          ((x) => (y) => (p) => p(x)(y))(x)(xs)
        ))(
        ((n) => (m) =>
          m(
            ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
          )((f) => (x) => x))((f) => (x) =>
          f(f(f(f(f(f(f(f(f(f(x))))))))))
        )((f) => (x) => f(f(f(f(f(f(f(x))))))))
      )(
        ((x) => (xs) =>
          ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
            ((x) => (y) => (p) => p(x)(y))(x)(xs)
          ))(
          ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
            ((n) => (m) =>
              m(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
              )((f) => (x) => x))((f) => (x) =>
              f(f(f(f(f(f(f(f(f(f(x))))))))))
            )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
          )((f) => (x) => f(f(f(f(f(x))))))
        )(
          ((x) => (xs) =>
            ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
              ((x) => (y) => (p) => p(x)(y))(x)(xs)
            ))(
            ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
              ((n) => (m) =>
                m(
                  ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                )((f) => (x) => x))((f) => (x) =>
                f(f(f(f(f(f(f(f(f(f(x))))))))))
              )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
            )(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                ((n) => (m) =>
                  m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                  f(f(f(f(f(f(f(f(f(f(x))))))))))
                )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
              )((f) => (x) => f(f(x)))
            )
          )(
            ((x) => (xs) =>
              ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                ((x) => (y) => (p) => p(x)(y))(x)(xs)
              ))(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                ((n) => (m) =>
                  m(
                    ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                  )((f) => (x) => x))((f) => (x) =>
                  f(f(f(f(f(f(f(f(f(f(x))))))))))
                )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
              )(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                  ((n) => (m) =>
                    m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                    f(f(f(f(f(f(f(f(f(f(x))))))))))
                  )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                )((f) => (x) => f(f(x)))
              )
            )(((x) => (y) => (p) => p(x)(y))((x) => (y) => x)((x) => (y) => x))
          )
        )
      )
    )(
      ((p) => (x) => (y) => p(x)(y))(
        ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
          ((f) =>
            ((x) => f((y) => x(x)(y)))((x) =>
              f((y) => x(x)(y))
            ))((r) => (n) => (m) =>
            ((p) => (x) => (y) => p(x)(y))(
              ((n) => (m) =>
                ((n) => n((m) => (x) => (y) => y)((x) => (y) => x))(
                  ((n) => (m) =>
                    m((n) =>
                      n((p) => (z) =>
                        z(
                          ((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x))
                        )(p((x) => (y) => x))
                      )((z) =>
                        z((f) => (x) => x)((f) => (x) => x)
                      )((x) => (y) => y)
                    )(n))(n)(m)
                ))(m)(n)
            )((x) =>
              r(
                ((n) => (m) =>
                  m((n) =>
                    n((p) => (z) =>
                      z(((n) => (f) => (x) => f(n(f)(x)))(p((x) => (y) => x)))(
                        p((x) => (y) => x)
                      )
                    )((z) => z((f) => (x) => x)((f) => (x) => x))((x) => (y) =>
                      y
                    )
                  )(n))(n)(m)
              )(m)(x)
            )(n)
          )(n)((f) => (x) => f(f(f(f(f(x))))))
        )
      )(
        ((x) => (xs) =>
          ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
            ((x) => (y) => (p) => p(x)(y))(x)(xs)
          ))(
          ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
            ((n) => (m) =>
              m(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
              )((f) => (x) => x))((f) => (x) =>
              f(f(f(f(f(f(f(f(f(f(x))))))))))
            )((f) => (x) => f(f(f(f(f(f(x)))))))
          )((f) => (x) => f(f(f(f(f(f(x)))))))
        )(
          ((x) => (xs) =>
            ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
              ((x) => (y) => (p) => p(x)(y))(x)(xs)
            ))(
            ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
              ((n) => (m) =>
                m(
                  ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                )((f) => (x) => x))((f) => (x) =>
                f(f(f(f(f(f(f(f(f(f(x))))))))))
              )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
            )(
              ((n) => (m) =>
                m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                f(f(f(f(f(f(f(f(f(f(x))))))))))
              )((f) => (x) => f(f(f(f(f(f(f(x))))))))
            )
          )(
            ((x) => (xs) =>
              ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                ((x) => (y) => (p) => p(x)(y))(x)(xs)
              ))(
              ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                ((n) => (m) =>
                  m(
                    ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                  )((f) => (x) => x))((f) => (x) =>
                  f(f(f(f(f(f(f(f(f(f(x))))))))))
                )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
              )(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                  ((n) => (m) =>
                    m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                    f(f(f(f(f(f(f(f(f(f(x))))))))))
                  )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                )((f) => (x) => f(f(x)))
              )
            )(
              ((x) => (xs) =>
                ((x) => (y) => (p) => p(x)(y))((x) => (y) => y)(
                  ((x) => (y) => (p) => p(x)(y))(x)(xs)
                ))(
                ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                  ((n) => (m) =>
                    m(
                      ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(n)
                    )((f) => (x) => x))((f) => (x) =>
                    f(f(f(f(f(f(f(f(f(f(x))))))))))
                  )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                )(
                  ((n) => (m) => m((n) => (f) => (x) => f(n(f)(x)))(n))(
                    ((n) => (m) =>
                      m((n) => (f) => (x) => f(n(f)(x)))(n))((f) => (x) =>
                      f(f(f(f(f(f(f(f(f(f(x))))))))))
                    )((f) => (x) => f(f(f(f(f(f(f(f(f(f(x)))))))))))
                  )((f) => (x) => f(f(x)))
                )
              )(
                ((x) => (y) => (p) => p(x)(y))((x) => (y) => x)((x) => (y) => x)
              )
            )
          )
        )
      )(n)
    )
  )
);

module.exports = {
  FIFTEEN,
  TWENTY,
  HUNDRED,
  F,
  I,
  Z,
  B,
  U,
  FIZZ,
  BUZZ,
  FIZZBUZZ,
  FIZZBUZZFUNC,
  FIZZBUZZFUNC_EXP,
};
